const responses = {
	pythagorean: {
		111: "Характер, сила воли — 111. 'Золотая середина' — характер так назван, потому что умеет ладить со всеми остальными характерами...",
		4: "Здоровье, красота — 4. 'Начальный запас здоровья'. Обычно одна четверка уходит либо в здоровье, либо в красоту...",
		22: "Энергетика, харизма — 22. 'Нормальная энергия' — любые обычные дела или кратковременные волевые действия будут по плечу...",
		5: "Логика, интуиция — 5. 'Задатки логики' — логика в человеке присутствует...",
		66: "Трудолюбие, мастерство — 66. 'Золотые руки' — при постоянном совершенствовании навыков человек может достигнуть мастерства в любом деле...",
		8: "Чувство долга — 8. 'Чувство долга в меру' — долга перед близкими и друзьями такие люди обычно не избегают...",
		99: "Память, ум — 99. 'Светлая голова' — любая учеба или работа с информацией дается очень легко...",
		column123: "Самооценка столбец «1-2-3» — 5. Включает в себя... (описание)",
		column456:
			"Зарабатывание денег столбец «4-5-6» — 4. Включает в себя... (описание)",
		column789:
			"Потенциал таланта столбец «7-8-9» — 3. Включает в себя... (описание)",
		row147:
			"Целеустремленность строка «1-4-7» — 4. Включает в себя... (описание)",
		row258: "Семейность строка «2-5-8» — 4. Включает в себя... (описание)",
		row369: "Стабильность строка «3-6-9» — 4. Включает в себя... (описание)",
		diagonal159:
			"Духовный потенциал диагональ «1-5-9» — 6. Включает в себя... (описание)",
		diagonal357:
			"Темперамент диагональ «3-5-7» — 1. Включает в себя... (описание)",
	},
	kabbalah: {
		0: "Ноль символизирует бесконечность, пустоту, доступ к тайнам бытия.",
		1: "Единица символизирует суть и первопричину, власть и настойчивость.",
		2: "Двойка символизирует взаимодействие, общение, мягкость.",
		3: "Тройка символизирует триединство жизни, вещества и разума.",
		4: "Четверка символизирует физическое здоровье и порядок.",
		5: "Пятерка символизирует перемены, цикличность и независимость.",
		6: "Шестерка символизирует гармонию, правду и доброту.",
		7: "Семерка символизирует совершенство и осмысление.",
		8: "Восьмерка символизирует стойкость и уверенность в правде.",
		9: "Девятка символизирует восстановление и связь с высшим.",
	},
};

module.exports = responses;
